UNIT-Electronics/Uelectronics-RP2040-Arduino-Package/patches/boards/boards.txt
rpipico2w.menu.ipbtstack.ipv4onlybig.build.libpicow=liblwip.a
rpipico2w.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
rpipico2w.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
rpipico2w.menu.ipbtstack.ipv4ipv6big.build.libpicow=liblwip.a
rpipico2w.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
rpipico2w.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
rpipico2w.menu.ipbtstack.ipv4btcblebig.build.libpicow=liblwip-bt.a
rpipico2w.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
rpipico2w.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
rpipico2w.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=liblwip-bt.a
rpipico2w.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
rpipico2w.menu.uploadmethod.default=Default (UF2)
rpipico2w.menu.uploadmethod.default.build.ram_length=512k
rpipico2w.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
rpipico2w.menu.uploadmethod.default.upload.maximum_data_size=524288
rpipico2w.menu.uploadmethod.default.upload.tool=uf2conv
rpipico2w.menu.uploadmethod.default.upload.tool.default=uf2conv
rpipico2w.menu.uploadmethod.default.upload.tool.network=uf2conv-network
rpipico2w.menu.uploadmethod.picotool=Picotool
rpipico2w.menu.uploadmethod.picotool.build.ram_length=512k
rpipico2w.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
rpipico2w.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
rpipico2w.menu.uploadmethod.picotool.upload.maximum_data_size=524288
rpipico2w.menu.uploadmethod.picotool.upload.tool=picotool
rpipico2w.menu.uploadmethod.picotool.upload.tool.default=picotool
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# UNIT DualMCU RP2040
# -----------------------------------
DualMCU_RP2040.name=UNIT DualMCU RP2040

DualMCU_RP2040.vid.0=0x2e8a
DualMCU_RP2040.pid.0=0x000a
DualMCU_RP2040.vid.1=0x2e8a
DualMCU_RP2040.pid.1=0x010a
DualMCU_RP2040.vid.2=0x2e8a
DualMCU_RP2040.pid.2=0x400a
DualMCU_RP2040.vid.3=0x2e8a
DualMCU_RP2040.pid.3=0x410a
DualMCU_RP2040.vid.4=0x2e8a
DualMCU_RP2040.pid.4=0x800a
DualMCU_RP2040.vid.5=0x2e8a
DualMCU_RP2040.pid.5=0x810a
DualMCU_RP2040.vid.6=0x2e8a
DualMCU_RP2040.pid.6=0xc00a
DualMCU_RP2040.vid.7=0x2e8a
DualMCU_RP2040.pid.7=0xc10a

DualMCU_RP2040.build.usbvid=-DUSBD_VID=0x2e8a
DualMCU_RP2040.build.usbpid=-DUSBD_PID=0x000a
DualMCU_RP2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250

DualMCU_RP2040.build.board=UNIT_DUALMCU_RP2040
DualMCU_RP2040.build.mcu=cortex-m0plus
DualMCU_RP2040.build.chip=rp2040
DualMCU_RP2040.build.toolchain=arm-none-eabi
DualMCU_RP2040.build.toolchainpkg=pqt-gcc
DualMCU_RP2040.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
DualMCU_RP2040.build.uf2family=--family rp2040
DualMCU_RP2040.build.variant=DualMCU_RP2040

DualMCU_RP2040.upload.tool=uf2conv
DualMCU_RP2040.upload.tool.default=uf2conv
DualMCU_RP2040.upload.tool.network=uf2conv-network
DualMCU_RP2040.upload.maximum_size=2097152
DualMCU_RP2040.upload.maximum_data_size=262144
DualMCU_RP2040.upload.wait_for_upload_port=true
DualMCU_RP2040.upload.erase_cmd=

DualMCU_RP2040.serial.disableDTR=false
DualMCU_RP2040.serial.disableRTS=false

DualMCU_RP2040.build.f_cpu=125000000
DualMCU_RP2040.build.led=
DualMCU_RP2040.build.core=rp2040
DualMCU_RP2040.build.ldscript=memmap_default.ld
DualMCU_RP2040.build.ram_length=256k
DualMCU_RP2040.build.debugscript=picoprobe.tcl
DualMCU_RP2040.build.boot2=boot2_w25q080_2_padded_checksum

DualMCU_RP2040.build.vid=0x2e8a
DualMCU_RP2040.build.pid=0x000a
DualMCU_RP2040.build.usb_manufacturer="UNIT Electronics"
DualMCU_RP2040.build.usb_product="DualMCU RP2040"


# -----------------------------------
# Flash Size - 2MB
# -----------------------------------

DualMCU_RP2040.menu.flash.2097152_0=2MB (no FS)
DualMCU_RP2040.menu.flash.2097152_0.upload.maximum_size=2093056
DualMCU_RP2040.menu.flash.2097152_0.build.flash_length=2093056
DualMCU_RP2040.menu.flash.2097152_0.build.eeprom_start=270528512
DualMCU_RP2040.menu.flash.2097152_0.build.fs_start=270528512
DualMCU_RP2040.menu.flash.2097152_0.build.fs_end=270528512

DualMCU_RP2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
DualMCU_RP2040.menu.flash.2097152_65536.upload.maximum_size=2027520
DualMCU_RP2040.menu.flash.2097152_65536.build.flash_length=2027520
DualMCU_RP2040.menu.flash.2097152_65536.build.eeprom_start=270528512
DualMCU_RP2040.menu.flash.2097152_65536.build.fs_start=270462976
DualMCU_RP2040.menu.flash.2097152_65536.build.fs_end=270528512

DualMCU_RP2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
DualMCU_RP2040.menu.flash.2097152_131072.upload.maximum_size=1961984
DualMCU_RP2040.menu.flash.2097152_131072.build.flash_length=1961984
DualMCU_RP2040.menu.flash.2097152_131072.build.eeprom_start=270528512
DualMCU_RP2040.menu.flash.2097152_131072.build.fs_start=270397440
DualMCU_RP2040.menu.flash.2097152_131072.build.fs_end=270528512

DualMCU_RP2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
DualMCU_RP2040.menu.flash.2097152_262144.upload.maximum_size=1830912
DualMCU_RP2040.menu.flash.2097152_262144.build.flash_length=1830912
DualMCU_RP2040.menu.flash.2097152_262144.build.eeprom_start=270528512
DualMCU_RP2040.menu.flash.2097152_262144.build.fs_start=270266368
DualMCU_RP2040.menu.flash.2097152_262144.build.fs_end=270528512

