UNIT-Electronics/Uelectronics-RP2040-Arduino-Package/patches/boards/boards.txt
DualMCU_RP2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
DualMCU_RP2040.menu.flash.2097152_524288.upload.maximum_size=1568768
DualMCU_RP2040.menu.flash.2097152_524288.build.flash_length=1568768
DualMCU_RP2040.menu.flash.2097152_524288.build.eeprom_start=270528512
DualMCU_RP2040.menu.flash.2097152_524288.build.fs_start=270004224
DualMCU_RP2040.menu.flash.2097152_524288.build.fs_end=270528512

DualMCU_RP2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
DualMCU_RP2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
DualMCU_RP2040.menu.flash.2097152_1048576.build.flash_length=1044480
DualMCU_RP2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
DualMCU_RP2040.menu.flash.2097152_1048576.build.fs_start=269479936
DualMCU_RP2040.menu.flash.2097152_1048576.build.fs_end=270528512


# -----------------------------------
# CPU Speed
# -----------------------------------

DualMCU_RP2040.menu.freq.133=133 MHz
DualMCU_RP2040.menu.freq.133.build.f_cpu=133000000L

DualMCU_RP2040.menu.freq.50=50 MHz
DualMCU_RP2040.menu.freq.50.build.f_cpu=50000000L

DualMCU_RP2040.menu.freq.100=100 MHz
DualMCU_RP2040.menu.freq.100.build.f_cpu=100000000L

DualMCU_RP2040.menu.freq.120=120 MHz
DualMCU_RP2040.menu.freq.120.build.f_cpu=120000000L

DualMCU_RP2040.menu.freq.125=125 MHz
DualMCU_RP2040.menu.freq.125.build.f_cpu=125000000L

DualMCU_RP2040.menu.freq.150=150 MHz (Overclock)
DualMCU_RP2040.menu.freq.150.build.f_cpu=150000000L

DualMCU_RP2040.menu.freq.175=175 MHz (Overclock)
DualMCU_RP2040.menu.freq.175.build.f_cpu=175000000L

DualMCU_RP2040.menu.freq.200=200 MHz (Overclock)
DualMCU_RP2040.menu.freq.200.build.f_cpu=200000000L

DualMCU_RP2040.menu.freq.225=225 MHz (Overclock)
DualMCU_RP2040.menu.freq.225.build.f_cpu=225000000L

DualMCU_RP2040.menu.freq.240=240 MHz (Overclock)
DualMCU_RP2040.menu.freq.240.build.f_cpu=240000000L

DualMCU_RP2040.menu.freq.250=250 MHz (Overclock)
DualMCU_RP2040.menu.freq.250.build.f_cpu=250000000L

DualMCU_RP2040.menu.freq.275=275 MHz (Overclock)
DualMCU_RP2040.menu.freq.275.build.f_cpu=275000000L

DualMCU_RP2040.menu.freq.300=300 MHz (Overclock)
DualMCU_RP2040.menu.freq.300.build.f_cpu=300000000L


# -----------------------------------
# Optimization
# -----------------------------------

DualMCU_RP2040.menu.opt.Small=Small (-Os) (standard)
DualMCU_RP2040.menu.opt.Small.build.flags.optimize=-Os

DualMCU_RP2040.menu.opt.Optimize=Optimize (-O)
DualMCU_RP2040.menu.opt.Optimize.build.flags.optimize=-O

DualMCU_RP2040.menu.opt.Optimize2=Optimize More (-O2)
DualMCU_RP2040.menu.opt.Optimize2.build.flags.optimize=-O2

DualMCU_RP2040.menu.opt.Optimize3=Optimize Even More (-O3)
DualMCU_RP2040.menu.opt.Optimize3.build.flags.optimize=-O3

DualMCU_RP2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
DualMCU_RP2040.menu.opt.Fast.build.flags.optimize=-Ofast

DualMCU_RP2040.menu.opt.Debug=Debug (-Og)
DualMCU_RP2040.menu.opt.Debug.build.flags.optimize=-Og


# -----------------------------------
# RTTI
# -----------------------------------

DualMCU_RP2040.menu.rtti.Disabled=Disabled
DualMCU_RP2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti

DualMCU_RP2040.menu.rtti.Enabled=Enabled
DualMCU_RP2040.menu.rtti.Enabled.build.flags.rtti=


# -----------------------------------
# Stack Protector
# -----------------------------------

DualMCU_RP2040.menu.stackprotect.Disabled=Disabled
DualMCU_RP2040.menu.stackprotect.Disabled.build.flags.stackprotect=

DualMCU_RP2040.menu.stackprotect.Enabled=Enabled
DualMCU_RP2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector


# -----------------------------------
# C++ Exceptions
# -----------------------------------

DualMCU_RP2040.menu.exceptions.Disabled=Disabled
DualMCU_RP2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
DualMCU_RP2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++

DualMCU_RP2040.menu.exceptions.Enabled=Enabled
DualMCU_RP2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
DualMCU_RP2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc


# -----------------------------------
# Debug Port
# -----------------------------------

DualMCU_RP2040.menu.dbgport.Disabled=Disabled
DualMCU_RP2040.menu.dbgport.Disabled.build.debug_port=

DualMCU_RP2040.menu.dbgport.Serial=Serial
DualMCU_RP2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial

DualMCU_RP2040.menu.dbgport.Serial1=Serial1
DualMCU_RP2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1

DualMCU_RP2040.menu.dbgport.Serial2=Serial2
DualMCU_RP2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2


# -----------------------------------
# Debug Level
# -----------------------------------

DualMCU_RP2040.menu.dbglvl.None=None
DualMCU_RP2040.menu.dbglvl.None.build.debug_level=

DualMCU_RP2040.menu.dbglvl.Core=Core
DualMCU_RP2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE

DualMCU_RP2040.menu.dbglvl.SPI=SPI
DualMCU_RP2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI

DualMCU_RP2040.menu.dbglvl.Wire=Wire
DualMCU_RP2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE

DualMCU_RP2040.menu.dbglvl.All=All
DualMCU_RP2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE

DualMCU_RP2040.menu.dbglvl.NDEBUG=NDEBUG
DualMCU_RP2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG


# -----------------------------------
# USB Stack
# -----------------------------------

DualMCU_RP2040.menu.usbstack.picosdk=Pico SDK
DualMCU_RP2040.menu.usbstack.picosdk.build.usbstack_flags=

DualMCU_RP2040.menu.usbstack.tinyusb=Adafruit TinyUSB
DualMCU_RP2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

DualMCU_RP2040.menu.usbstack.nousb=No USB
DualMCU_RP2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"


# -----------------------------------
# IP Stack
# -----------------------------------

DualMCU_RP2040.menu.ipstack.ipv4only=IPv4 Only
DualMCU_RP2040.menu.ipstack.ipv4only.build.libpico=libpico.a
DualMCU_RP2040.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1

DualMCU_RP2040.menu.ipstack.ipv4ipv6=IPv4 and IPv6
DualMCU_RP2040.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
DualMCU_RP2040.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

# -----------------------------------
# UNIT Dual ONE RP2040
# -----------------------------------

DualONE_RP2040.name=UNIT Dual ONE RP2040

DualONE_RP2040.vid.0=0x2e8a
DualONE_RP2040.pid.0=0x000a
DualONE_RP2040.vid.1=0x2e8a
DualONE_RP2040.pid.1=0x010a
DualONE_RP2040.vid.2=0x2e8a
DualONE_RP2040.pid.2=0x400a
DualONE_RP2040.vid.3=0x2e8a
DualONE_RP2040.pid.3=0x410a
DualONE_RP2040.vid.4=0x2e8a
DualONE_RP2040.pid.4=0x800a
DualONE_RP2040.vid.5=0x2e8a
DualONE_RP2040.pid.5=0x810a
DualONE_RP2040.vid.6=0x2e8a
DualONE_RP2040.pid.6=0xc00a
DualONE_RP2040.vid.7=0x2e8a
DualONE_RP2040.pid.7=0xc10a

DualONE_RP2040.build.usbvid=-DUSBD_VID=0x2e8a
DualONE_RP2040.build.usbpid=-DUSBD_PID=0x000a
DualONE_RP2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250

