UNIT-Electronics/Uelectronics-RP2040-Arduino-Package/patches/boards/boards.txt
DualONE_RP2040.build.board=UNIT_DUALONE_RP2040
DualONE_RP2040.build.mcu=cortex-m0plus
DualONE_RP2040.build.chip=rp2040
DualONE_RP2040.build.toolchain=arm-none-eabi
DualONE_RP2040.build.toolchainpkg=pqt-gcc
DualONE_RP2040.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
DualONE_RP2040.build.uf2family=--family rp2040
DualONE_RP2040.build.variant=DualONE_RP2040

DualONE_RP2040.upload.tool=uf2conv
DualONE_RP2040.upload.tool.default=uf2conv
DualONE_RP2040.upload.tool.network=uf2conv-network

DualONE_RP2040.upload.maximum_size=2097152
DualONE_RP2040.upload.maximum_data_size=262144
DualONE_RP2040.upload.wait_for_upload_port=true
DualONE_RP2040.upload.erase_cmd=

DualONE_RP2040.serial.disableDTR=false
DualONE_RP2040.serial.disableRTS=false

DualONE_RP2040.build.f_cpu=125000000
DualONE_RP2040.build.led=
DualONE_RP2040.build.core=rp2040
DualONE_RP2040.build.ldscript=memmap_default.ld
DualONE_RP2040.build.ram_length=256k
DualONE_RP2040.build.debugscript=picoprobe.tcl
DualONE_RP2040.build.boot2=boot2_w25q080_2_padded_checksum

DualONE_RP2040.build.vid=0x2e8a
DualONE_RP2040.build.pid=0x000a
DualONE_RP2040.build.usb_manufacturer="UNIT Electronics"
DualONE_RP2040.build.usb_product="Dual ONE RP2040"


# -----------------------------------
# Flash Size - 2MB
# -----------------------------------

DualONE_RP2040.menu.flash.2097152_0=2MB (no FS)
DualONE_RP2040.menu.flash.2097152_0.upload.maximum_size=2093056
DualONE_RP2040.menu.flash.2097152_0.build.flash_length=2093056
DualONE_RP2040.menu.flash.2097152_0.build.eeprom_start=270528512
DualONE_RP2040.menu.flash.2097152_0.build.fs_start=270528512
DualONE_RP2040.menu.flash.2097152_0.build.fs_end=270528512

DualONE_RP2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
DualONE_RP2040.menu.flash.2097152_65536.upload.maximum_size=2027520
DualONE_RP2040.menu.flash.2097152_65536.build.flash_length=2027520
DualONE_RP2040.menu.flash.2097152_65536.build.eeprom_start=270528512
DualONE_RP2040.menu.flash.2097152_65536.build.fs_start=270462976
DualONE_RP2040.menu.flash.2097152_65536.build.fs_end=270528512

DualONE_RP2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
DualONE_RP2040.menu.flash.2097152_131072.upload.maximum_size=1961984
DualONE_RP2040.menu.flash.2097152_131072.build.flash_length=1961984
DualONE_RP2040.menu.flash.2097152_131072.build.eeprom_start=270528512
DualONE_RP2040.menu.flash.2097152_131072.build.fs_start=270397440
DualONE_RP2040.menu.flash.2097152_131072.build.fs_end=270528512

DualONE_RP2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
DualONE_RP2040.menu.flash.2097152_262144.upload.maximum_size=1830912
DualONE_RP2040.menu.flash.2097152_262144.build.flash_length=1830912
DualONE_RP2040.menu.flash.2097152_262144.build.eeprom_start=270528512
DualONE_RP2040.menu.flash.2097152_262144.build.fs_start=270266368
DualONE_RP2040.menu.flash.2097152_262144.build.fs_end=270528512

DualONE_RP2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
DualONE_RP2040.menu.flash.2097152_524288.upload.maximum_size=1568768
DualONE_RP2040.menu.flash.2097152_524288.build.flash_length=1568768
DualONE_RP2040.menu.flash.2097152_524288.build.eeprom_start=270528512
DualONE_RP2040.menu.flash.2097152_524288.build.fs_start=270004224
DualONE_RP2040.menu.flash.2097152_524288.build.fs_end=270528512

DualONE_RP2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
DualONE_RP2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
DualONE_RP2040.menu.flash.2097152_1048576.build.flash_length=1044480
DualONE_RP2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
DualONE_RP2040.menu.flash.2097152_1048576.build.fs_start=269479936
DualONE_RP2040.menu.flash.2097152_1048576.build.fs_end=270528512


# -----------------------------------
# CPU Speed
# -----------------------------------

DualONE_RP2040.menu.freq.133=133 MHz
DualONE_RP2040.menu.freq.133.build.f_cpu=133000000L

DualONE_RP2040.menu.freq.50=50 MHz
DualONE_RP2040.menu.freq.50.build.f_cpu=50000000L

DualONE_RP2040.menu.freq.100=100 MHz
DualONE_RP2040.menu.freq.100.build.f_cpu=100000000L

DualONE_RP2040.menu.freq.120=120 MHz
DualONE_RP2040.menu.freq.120.build.f_cpu=120000000L

DualONE_RP2040.menu.freq.125=125 MHz
DualONE_RP2040.menu.freq.125.build.f_cpu=125000000L

DualONE_RP2040.menu.freq.150=150 MHz (Overclock)
DualONE_RP2040.menu.freq.150.build.f_cpu=150000000L

DualONE_RP2040.menu.freq.175=175 MHz (Overclock)
DualONE_RP2040.menu.freq.175.build.f_cpu=175000000L

DualONE_RP2040.menu.freq.200=200 MHz (Overclock)
DualONE_RP2040.menu.freq.200.build.f_cpu=200000000L

DualONE_RP2040.menu.freq.225=225 MHz (Overclock)
DualONE_RP2040.menu.freq.225.build.f_cpu=225000000L

DualONE_RP2040.menu.freq.240=240 MHz (Overclock)
DualONE_RP2040.menu.freq.240.build.f_cpu=240000000L

DualONE_RP2040.menu.freq.250=250 MHz (Overclock)
DualONE_RP2040.menu.freq.250.build.f_cpu=250000000L

DualONE_RP2040.menu.freq.275=275 MHz (Overclock)
DualONE_RP2040.menu.freq.275.build.f_cpu=275000000L

DualONE_RP2040.menu.freq.300=300 MHz (Overclock)
DualONE_RP2040.menu.freq.300.build.f_cpu=300000000L


# -----------------------------------
# Optimization
# -----------------------------------

DualONE_RP2040.menu.opt.Small=Small (-Os) (standard)
DualONE_RP2040.menu.opt.Small.build.flags.optimize=-Os

DualONE_RP2040.menu.opt.Optimize=Optimize (-O)
DualONE_RP2040.menu.opt.Optimize.build.flags.optimize=-O

DualONE_RP2040.menu.opt.Optimize2=Optimize More (-O2)
DualONE_RP2040.menu.opt.Optimize2.build.flags.optimize=-O2

DualONE_RP2040.menu.opt.Optimize3=Optimize Even More (-O3)
DualONE_RP2040.menu.opt.Optimize3.build.flags.optimize=-O3

DualONE_RP2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
DualONE_RP2040.menu.opt.Fast.build.flags.optimize=-Ofast

DualONE_RP2040.menu.opt.Debug=Debug (-Og)
DualONE_RP2040.menu.opt.Debug.build.flags.optimize=-Og


# -----------------------------------
# RTTI
# -----------------------------------

DualONE_RP2040.menu.rtti.Disabled=Disabled
DualONE_RP2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti

DualONE_RP2040.menu.rtti.Enabled=Enabled
DualONE_RP2040.menu.rtti.Enabled.build.flags.rtti=


# -----------------------------------
# Stack Protector
# -----------------------------------

DualONE_RP2040.menu.stackprotect.Disabled=Disabled
DualONE_RP2040.menu.stackprotect.Disabled.build.flags.stackprotect=

DualONE_RP2040.menu.stackprotect.Enabled=Enabled
DualONE_RP2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector


# -----------------------------------
# C++ Exceptions
# -----------------------------------

