UNIT-Electronics/Uelectronics-RP2040-Arduino-Package/patches/boards/boards.txt
DualONE_RP2040.menu.exceptions.Disabled=Disabled
DualONE_RP2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
DualONE_RP2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++

DualONE_RP2040.menu.exceptions.Enabled=Enabled
DualONE_RP2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
DualONE_RP2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc


# -----------------------------------
# Debug Port
# -----------------------------------

DualONE_RP2040.menu.dbgport.Disabled=Disabled
DualONE_RP2040.menu.dbgport.Disabled.build.debug_port=

DualONE_RP2040.menu.dbgport.Serial=Serial
DualONE_RP2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial

DualONE_RP2040.menu.dbgport.Serial1=Serial1
DualONE_RP2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1

DualONE_RP2040.menu.dbgport.Serial2=Serial2
DualONE_RP2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2


# -----------------------------------
# Debug Level
# -----------------------------------

DualONE_RP2040.menu.dbglvl.None=None
DualONE_RP2040.menu.dbglvl.None.build.debug_level=

DualONE_RP2040.menu.dbglvl.Core=Core
DualONE_RP2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE

DualONE_RP2040.menu.dbglvl.SPI=SPI
DualONE_RP2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI

DualONE_RP2040.menu.dbglvl.Wire=Wire
DualONE_RP2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE

DualONE_RP2040.menu.dbglvl.All=All
DualONE_RP2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE

DualONE_RP2040.menu.dbglvl.NDEBUG=NDEBUG
DualONE_RP2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG


# -----------------------------------
# USB Stack
# -----------------------------------

DualONE_RP2040.menu.usbstack.picosdk=Pico SDK
DualONE_RP2040.menu.usbstack.picosdk.build.usbstack_flags=

DualONE_RP2040.menu.usbstack.tinyusb=Adafruit TinyUSB
DualONE_RP2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

DualONE_RP2040.menu.usbstack.nousb=No USB
DualONE_RP2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"


# -----------------------------------
# IP Stack
# -----------------------------------

DualONE_RP2040.menu.ipstack.ipv4only=IPv4 Only
DualONE_RP2040.menu.ipstack.ipv4only.build.libpico=libpico.a
DualONE_RP2040.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1

DualONE_RP2040.menu.ipstack.ipv4ipv6=IPv4 and IPv6
DualONE_RP2040.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
DualONE_RP2040.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1


# -----------------------------------
# UNIT Pulsar RP2350A
# -----------------------------------
pulsar_rp2350a.name=UNIT Pulsar RP2350A
pulsar_rp2350a.vid.0=0x2e8a
pulsar_rp2350a.pid.0=0xf00f
pulsar_rp2350a.vid.1=0x2e8a
pulsar_rp2350a.pid.1=0xf10f
pulsar_rp2350a.upload_port.0.vid=0x2e8a
pulsar_rp2350a.upload_port.0.pid=0xf00f
pulsar_rp2350a.upload_port.1.vid=0x2e8a
pulsar_rp2350a.upload_port.1.pid=0xf10f
pulsar_rp2350a.build.usbvid=-DUSBD_VID=0x2e8a
pulsar_rp2350a.build.usbpid=-DUSBD_PID=0xf00f
pulsar_rp2350a.build.usbpwr=-DUSBD_MAX_POWER_MA=250
pulsar_rp2350a.build.board=UNIT_PULSAR_RP2350A
pulsar_rp2350a.build.variant=pulsar_rp2350a
pulsar_rp2350a.build.variantdefines=-D__PICO_RP2350A=1
pulsar_rp2350a.upload.maximum_size=16777216
pulsar_rp2350a.upload.wait_for_upload_port=true
pulsar_rp2350a.upload.erase_cmd=
pulsar_rp2350a.serial.disableDTR=false
pulsar_rp2350a.serial.disableRTS=false
pulsar_rp2350a.build.f_cpu=125000000
pulsar_rp2350a.build.led=
pulsar_rp2350a.build.core=rp2040
pulsar_rp2350a.build.ldscript=memmap_default.ld
pulsar_rp2350a.build.boot2=none
pulsar_rp2350a.build.usb_manufacturer="UNIT Electronics"
pulsar_rp2350a.build.usb_product="Pulsar RP2350A"
pulsar_rp2350a.build.psram_length=0x800000
pulsar_rp2350a.menu.flash.16777216_0=16MB (no FS)
pulsar_rp2350a.menu.flash.16777216_0.upload.maximum_size=16769024
pulsar_rp2350a.menu.flash.16777216_0.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_0.build.flash_length=16769024
pulsar_rp2350a.menu.flash.16777216_0.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_0.build.fs_start=285204480
pulsar_rp2350a.menu.flash.16777216_0.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
pulsar_rp2350a.menu.flash.16777216_65536.upload.maximum_size=16703488
pulsar_rp2350a.menu.flash.16777216_65536.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_65536.build.flash_length=16703488
pulsar_rp2350a.menu.flash.16777216_65536.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_65536.build.fs_start=285138944
pulsar_rp2350a.menu.flash.16777216_65536.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
pulsar_rp2350a.menu.flash.16777216_131072.upload.maximum_size=16637952
pulsar_rp2350a.menu.flash.16777216_131072.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_131072.build.flash_length=16637952
pulsar_rp2350a.menu.flash.16777216_131072.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_131072.build.fs_start=285073408
pulsar_rp2350a.menu.flash.16777216_131072.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
pulsar_rp2350a.menu.flash.16777216_262144.upload.maximum_size=16506880
pulsar_rp2350a.menu.flash.16777216_262144.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_262144.build.flash_length=16506880
pulsar_rp2350a.menu.flash.16777216_262144.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_262144.build.fs_start=284942336
pulsar_rp2350a.menu.flash.16777216_262144.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
pulsar_rp2350a.menu.flash.16777216_524288.upload.maximum_size=16244736
pulsar_rp2350a.menu.flash.16777216_524288.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_524288.build.flash_length=16244736
pulsar_rp2350a.menu.flash.16777216_524288.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_524288.build.fs_start=284680192
pulsar_rp2350a.menu.flash.16777216_524288.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
pulsar_rp2350a.menu.flash.16777216_1048576.upload.maximum_size=15720448
pulsar_rp2350a.menu.flash.16777216_1048576.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_1048576.build.flash_length=15720448
pulsar_rp2350a.menu.flash.16777216_1048576.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_1048576.build.fs_start=284155904
pulsar_rp2350a.menu.flash.16777216_1048576.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
pulsar_rp2350a.menu.flash.16777216_2097152.upload.maximum_size=14671872
pulsar_rp2350a.menu.flash.16777216_2097152.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_2097152.build.flash_length=14671872
pulsar_rp2350a.menu.flash.16777216_2097152.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_2097152.build.fs_start=283107328
pulsar_rp2350a.menu.flash.16777216_2097152.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
pulsar_rp2350a.menu.flash.16777216_3145728.upload.maximum_size=13623296
pulsar_rp2350a.menu.flash.16777216_3145728.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_3145728.build.flash_length=13623296
pulsar_rp2350a.menu.flash.16777216_3145728.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_3145728.build.fs_start=282058752
pulsar_rp2350a.menu.flash.16777216_3145728.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
pulsar_rp2350a.menu.flash.16777216_4194304.upload.maximum_size=12574720
pulsar_rp2350a.menu.flash.16777216_4194304.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_4194304.build.flash_length=12574720
pulsar_rp2350a.menu.flash.16777216_4194304.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_4194304.build.fs_start=281010176
pulsar_rp2350a.menu.flash.16777216_4194304.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
pulsar_rp2350a.menu.flash.16777216_5242880.upload.maximum_size=11526144
pulsar_rp2350a.menu.flash.16777216_5242880.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_5242880.build.flash_length=11526144
pulsar_rp2350a.menu.flash.16777216_5242880.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_5242880.build.fs_start=279961600
pulsar_rp2350a.menu.flash.16777216_5242880.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
pulsar_rp2350a.menu.flash.16777216_6291456.upload.maximum_size=10477568
pulsar_rp2350a.menu.flash.16777216_6291456.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_6291456.build.flash_length=10477568
pulsar_rp2350a.menu.flash.16777216_6291456.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_6291456.build.fs_start=278913024
pulsar_rp2350a.menu.flash.16777216_6291456.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
pulsar_rp2350a.menu.flash.16777216_7340032.upload.maximum_size=9428992
pulsar_rp2350a.menu.flash.16777216_7340032.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_7340032.build.flash_length=9428992
pulsar_rp2350a.menu.flash.16777216_7340032.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_7340032.build.fs_start=277864448
pulsar_rp2350a.menu.flash.16777216_7340032.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
pulsar_rp2350a.menu.flash.16777216_8388608.upload.maximum_size=8380416
pulsar_rp2350a.menu.flash.16777216_8388608.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_8388608.build.flash_length=8380416
pulsar_rp2350a.menu.flash.16777216_8388608.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_8388608.build.fs_start=276815872
pulsar_rp2350a.menu.flash.16777216_8388608.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
pulsar_rp2350a.menu.flash.16777216_9437184.upload.maximum_size=7331840
pulsar_rp2350a.menu.flash.16777216_9437184.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_9437184.build.flash_length=7331840
pulsar_rp2350a.menu.flash.16777216_9437184.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_9437184.build.fs_start=275767296
pulsar_rp2350a.menu.flash.16777216_9437184.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
pulsar_rp2350a.menu.flash.16777216_10485760.upload.maximum_size=6283264
pulsar_rp2350a.menu.flash.16777216_10485760.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_10485760.build.flash_length=6283264
pulsar_rp2350a.menu.flash.16777216_10485760.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_10485760.build.fs_start=274718720
pulsar_rp2350a.menu.flash.16777216_10485760.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
pulsar_rp2350a.menu.flash.16777216_11534336.upload.maximum_size=5234688
pulsar_rp2350a.menu.flash.16777216_11534336.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_11534336.build.flash_length=5234688
pulsar_rp2350a.menu.flash.16777216_11534336.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_11534336.build.fs_start=273670144
pulsar_rp2350a.menu.flash.16777216_11534336.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
pulsar_rp2350a.menu.flash.16777216_12582912.upload.maximum_size=4186112
pulsar_rp2350a.menu.flash.16777216_12582912.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_12582912.build.flash_length=4186112
pulsar_rp2350a.menu.flash.16777216_12582912.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_12582912.build.fs_start=272621568
pulsar_rp2350a.menu.flash.16777216_12582912.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
pulsar_rp2350a.menu.flash.16777216_13631488.upload.maximum_size=3137536
pulsar_rp2350a.menu.flash.16777216_13631488.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_13631488.build.flash_length=3137536
pulsar_rp2350a.menu.flash.16777216_13631488.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_13631488.build.fs_start=271572992
pulsar_rp2350a.menu.flash.16777216_13631488.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
pulsar_rp2350a.menu.flash.16777216_14680064.upload.maximum_size=2088960
pulsar_rp2350a.menu.flash.16777216_14680064.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_14680064.build.flash_length=2088960
pulsar_rp2350a.menu.flash.16777216_14680064.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_14680064.build.fs_start=270524416
pulsar_rp2350a.menu.flash.16777216_14680064.build.fs_end=285204480
pulsar_rp2350a.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
pulsar_rp2350a.menu.flash.16777216_15728640.upload.maximum_size=1040384
pulsar_rp2350a.menu.flash.16777216_15728640.build.flash_total=16777216
pulsar_rp2350a.menu.flash.16777216_15728640.build.flash_length=1040384
pulsar_rp2350a.menu.flash.16777216_15728640.build.eeprom_start=285204480
pulsar_rp2350a.menu.flash.16777216_15728640.build.fs_start=269475840
pulsar_rp2350a.menu.flash.16777216_15728640.build.fs_end=285204480
pulsar_rp2350a.menu.arch.arm=ARM
pulsar_rp2350a.menu.arch.arm.build.chip=rp2350
pulsar_rp2350a.menu.arch.arm.build.toolchain=arm-none-eabi
pulsar_rp2350a.menu.arch.arm.build.toolchainpkg=pqt-gcc
pulsar_rp2350a.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
pulsar_rp2350a.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
pulsar_rp2350a.menu.arch.arm.build.mcu=cortex-m33
pulsar_rp2350a.menu.arch.riscv=RISC-V
pulsar_rp2350a.menu.arch.riscv.build.chip=rp2350-riscv
pulsar_rp2350a.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
pulsar_rp2350a.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
pulsar_rp2350a.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
pulsar_rp2350a.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
pulsar_rp2350a.menu.arch.riscv.build.mcu=rv32imac
pulsar_rp2350a.menu.freq.150=150 MHz
pulsar_rp2350a.menu.freq.150.build.f_cpu=150000000L
pulsar_rp2350a.menu.freq.50=50 MHz
pulsar_rp2350a.menu.freq.50.build.f_cpu=50000000L
pulsar_rp2350a.menu.freq.100=100 MHz
pulsar_rp2350a.menu.freq.100.build.f_cpu=100000000L
pulsar_rp2350a.menu.freq.120=120 MHz
pulsar_rp2350a.menu.freq.120.build.f_cpu=120000000L
pulsar_rp2350a.menu.freq.125=125 MHz
pulsar_rp2350a.menu.freq.125.build.f_cpu=125000000L
pulsar_rp2350a.menu.freq.128=128 MHz
pulsar_rp2350a.menu.freq.128.build.f_cpu=128000000L
pulsar_rp2350a.menu.freq.133=133 MHz
pulsar_rp2350a.menu.freq.133.build.f_cpu=133000000L
pulsar_rp2350a.menu.freq.176=176 MHz (Overclock)
pulsar_rp2350a.menu.freq.176.build.f_cpu=176000000L
pulsar_rp2350a.menu.freq.200=200 MHz (Overclock)
pulsar_rp2350a.menu.freq.200.build.f_cpu=200000000L
pulsar_rp2350a.menu.freq.225=225 MHz (Overclock)
pulsar_rp2350a.menu.freq.225.build.f_cpu=225000000L
pulsar_rp2350a.menu.freq.240=240 MHz (Overclock)
pulsar_rp2350a.menu.freq.240.build.f_cpu=240000000L
pulsar_rp2350a.menu.freq.250=250 MHz (Overclock)
pulsar_rp2350a.menu.freq.250.build.f_cpu=250000000L
pulsar_rp2350a.menu.freq.276=276 MHz (Overclock)
pulsar_rp2350a.menu.freq.276.build.f_cpu=276000000L
pulsar_rp2350a.menu.freq.300=300 MHz (Overclock)
pulsar_rp2350a.menu.freq.300.build.f_cpu=300000000L
pulsar_rp2350a.menu.opt.Small=Small (-Os) (standard)
pulsar_rp2350a.menu.opt.Small.build.flags.optimize=-Os
pulsar_rp2350a.menu.opt.Optimize=Optimize (-O)
pulsar_rp2350a.menu.opt.Optimize.build.flags.optimize=-O
pulsar_rp2350a.menu.opt.Optimize2=Optimize More (-O2)
pulsar_rp2350a.menu.opt.Optimize2.build.flags.optimize=-O2
pulsar_rp2350a.menu.opt.Optimize3=Optimize Even More (-O3)
pulsar_rp2350a.menu.opt.Optimize3.build.flags.optimize=-O3
pulsar_rp2350a.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pulsar_rp2350a.menu.opt.Fast.build.flags.optimize=-Ofast
pulsar_rp2350a.menu.opt.Debug=Debug (-Og)
pulsar_rp2350a.menu.opt.Debug.build.flags.optimize=-Og
pulsar_rp2350a.menu.opt.Disabled=Disabled (-O0)
pulsar_rp2350a.menu.opt.Disabled.build.flags.optimize=-O0
pulsar_rp2350a.menu.os.none=None
pulsar_rp2350a.menu.os.none.build.os=
pulsar_rp2350a.menu.os.freertos=FreeRTOS SMP
pulsar_rp2350a.menu.os.freertos.build.os=-D__FREERTOS
pulsar_rp2350a.menu.profile.Disabled=Disabled
pulsar_rp2350a.menu.profile.Disabled.build.flags.profile=
pulsar_rp2350a.menu.profile.Enabled=Enabled
pulsar_rp2350a.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
pulsar_rp2350a.menu.rtti.Disabled=Disabled
pulsar_rp2350a.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pulsar_rp2350a.menu.rtti.Enabled=Enabled
pulsar_rp2350a.menu.rtti.Enabled.build.flags.rtti=
pulsar_rp2350a.menu.stackprotect.Disabled=Disabled
pulsar_rp2350a.menu.stackprotect.Disabled.build.flags.stackprotect=
pulsar_rp2350a.menu.stackprotect.Enabled=Enabled
pulsar_rp2350a.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
pulsar_rp2350a.menu.exceptions.Disabled=Disabled
pulsar_rp2350a.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pulsar_rp2350a.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pulsar_rp2350a.menu.exceptions.Enabled=Enabled
pulsar_rp2350a.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pulsar_rp2350a.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
