UNIT-Electronics/Uelectronics-RP2040-Arduino-Package/patches/boards/boards.txt
# -----------------------------------
# Generic RP2350
# -----------------------------------
generic_rp2350.name=Generic RP2350
generic_rp2350.vid.0=0x2e8a
generic_rp2350.pid.0=0xf00f
generic_rp2350.vid.1=0x2e8a
generic_rp2350.pid.1=0xf10f
generic_rp2350.upload_port.0.vid=0x2e8a
generic_rp2350.upload_port.0.pid=0xf00f
generic_rp2350.upload_port.1.vid=0x2e8a
generic_rp2350.upload_port.1.pid=0xf10f
generic_rp2350.build.usbvid=-DUSBD_VID=0x2e8a
generic_rp2350.build.usbpid=-DUSBD_PID=0xf00f
generic_rp2350.build.usbpwr=-DUSBD_MAX_POWER_MA=250
generic_rp2350.build.board=GENERIC_RP2350
generic_rp2350.build.variant=generic_rp2350
generic_rp2350.upload.maximum_size=16777216
generic_rp2350.upload.wait_for_upload_port=true
generic_rp2350.upload.erase_cmd=
generic_rp2350.serial.disableDTR=false
generic_rp2350.serial.disableRTS=false
generic_rp2350.build.f_cpu=125000000
generic_rp2350.build.led=
generic_rp2350.build.core=rp2040
generic_rp2350.build.ldscript=memmap_default.ld
generic_rp2350.build.boot2=none
generic_rp2350.build.usb_manufacturer="Generic"
generic_rp2350.build.usb_product="RP2350"
generic_rp2350.menu.flash.2097152_0=2MB (no FS)
generic_rp2350.menu.flash.2097152_0.upload.maximum_size=2088960
generic_rp2350.menu.flash.2097152_0.build.flash_total=2097152
generic_rp2350.menu.flash.2097152_0.build.flash_length=2088960
generic_rp2350.menu.flash.2097152_0.build.eeprom_start=270524416
generic_rp2350.menu.flash.2097152_0.build.fs_start=270524416
generic_rp2350.menu.flash.2097152_0.build.fs_end=270524416
generic_rp2350.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
generic_rp2350.menu.flash.2097152_65536.upload.maximum_size=2023424
generic_rp2350.menu.flash.2097152_65536.build.flash_total=2097152
generic_rp2350.menu.flash.2097152_65536.build.flash_length=2023424
generic_rp2350.menu.flash.2097152_65536.build.eeprom_start=270524416
generic_rp2350.menu.flash.2097152_65536.build.fs_start=270458880
generic_rp2350.menu.flash.2097152_65536.build.fs_end=270524416
generic_rp2350.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
generic_rp2350.menu.flash.2097152_131072.upload.maximum_size=1957888
generic_rp2350.menu.flash.2097152_131072.build.flash_total=2097152
generic_rp2350.menu.flash.2097152_131072.build.flash_length=1957888
generic_rp2350.menu.flash.2097152_131072.build.eeprom_start=270524416
generic_rp2350.menu.flash.2097152_131072.build.fs_start=270393344
generic_rp2350.menu.flash.2097152_131072.build.fs_end=270524416
generic_rp2350.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
generic_rp2350.menu.flash.2097152_262144.upload.maximum_size=1826816
generic_rp2350.menu.flash.2097152_262144.build.flash_total=2097152
generic_rp2350.menu.flash.2097152_262144.build.flash_length=1826816
generic_rp2350.menu.flash.2097152_262144.build.eeprom_start=270524416
generic_rp2350.menu.flash.2097152_262144.build.fs_start=270262272
generic_rp2350.menu.flash.2097152_262144.build.fs_end=270524416
generic_rp2350.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
generic_rp2350.menu.flash.2097152_524288.upload.maximum_size=1564672
generic_rp2350.menu.flash.2097152_524288.build.flash_total=2097152
generic_rp2350.menu.flash.2097152_524288.build.flash_length=1564672
generic_rp2350.menu.flash.2097152_524288.build.eeprom_start=270524416
generic_rp2350.menu.flash.2097152_524288.build.fs_start=270000128
generic_rp2350.menu.flash.2097152_524288.build.fs_end=270524416
generic_rp2350.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
generic_rp2350.menu.flash.2097152_1048576.upload.maximum_size=1040384
generic_rp2350.menu.flash.2097152_1048576.build.flash_total=2097152
generic_rp2350.menu.flash.2097152_1048576.build.flash_length=1040384
generic_rp2350.menu.flash.2097152_1048576.build.eeprom_start=270524416
generic_rp2350.menu.flash.2097152_1048576.build.fs_start=269475840
generic_rp2350.menu.flash.2097152_1048576.build.fs_end=270524416
generic_rp2350.menu.flash.4194304_0=4MB (no FS)
generic_rp2350.menu.flash.4194304_0.upload.maximum_size=4186112
generic_rp2350.menu.flash.4194304_0.build.flash_total=4194304
generic_rp2350.menu.flash.4194304_0.build.flash_length=4186112
generic_rp2350.menu.flash.4194304_0.build.eeprom_start=272621568
generic_rp2350.menu.flash.4194304_0.build.fs_start=272621568
generic_rp2350.menu.flash.4194304_0.build.fs_end=272621568
generic_rp2350.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
generic_rp2350.menu.flash.4194304_3145728.upload.maximum_size=1040384
generic_rp2350.menu.flash.4194304_3145728.build.flash_total=4194304
generic_rp2350.menu.flash.4194304_3145728.build.flash_length=1040384
generic_rp2350.menu.flash.4194304_3145728.build.eeprom_start=272621568
generic_rp2350.menu.flash.4194304_3145728.build.fs_start=269475840
generic_rp2350.menu.flash.4194304_3145728.build.fs_end=272621568
generic_rp2350.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
generic_rp2350.menu.flash.4194304_2097152.upload.maximum_size=2088960
generic_rp2350.menu.flash.4194304_2097152.build.flash_total=4194304
generic_rp2350.menu.flash.4194304_2097152.build.flash_length=2088960
generic_rp2350.menu.flash.4194304_2097152.build.eeprom_start=272621568
generic_rp2350.menu.flash.4194304_2097152.build.fs_start=270524416
generic_rp2350.menu.flash.4194304_2097152.build.fs_end=272621568
generic_rp2350.menu.flash.8388608_0=8MB (no FS)
generic_rp2350.menu.flash.8388608_0.upload.maximum_size=8380416
generic_rp2350.menu.flash.8388608_0.build.flash_total=8388608
generic_rp2350.menu.flash.8388608_0.build.flash_length=8380416
generic_rp2350.menu.flash.8388608_0.build.eeprom_start=276815872
generic_rp2350.menu.flash.8388608_0.build.fs_start=276815872
generic_rp2350.menu.flash.8388608_0.build.fs_end=276815872
generic_rp2350.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
generic_rp2350.menu.flash.8388608_7340032.upload.maximum_size=1040384
generic_rp2350.menu.flash.8388608_7340032.build.flash_total=8388608
generic_rp2350.menu.flash.8388608_7340032.build.flash_length=1040384
generic_rp2350.menu.flash.8388608_7340032.build.eeprom_start=276815872
generic_rp2350.menu.flash.8388608_7340032.build.fs_start=269475840
generic_rp2350.menu.flash.8388608_7340032.build.fs_end=276815872
generic_rp2350.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
generic_rp2350.menu.flash.8388608_4194304.upload.maximum_size=4186112
generic_rp2350.menu.flash.8388608_4194304.build.flash_total=8388608
generic_rp2350.menu.flash.8388608_4194304.build.flash_length=4186112
generic_rp2350.menu.flash.8388608_4194304.build.eeprom_start=276815872
generic_rp2350.menu.flash.8388608_4194304.build.fs_start=272621568
generic_rp2350.menu.flash.8388608_4194304.build.fs_end=276815872
generic_rp2350.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
generic_rp2350.menu.flash.8388608_2097152.upload.maximum_size=6283264
generic_rp2350.menu.flash.8388608_2097152.build.flash_total=8388608
generic_rp2350.menu.flash.8388608_2097152.build.flash_length=6283264
generic_rp2350.menu.flash.8388608_2097152.build.eeprom_start=276815872
generic_rp2350.menu.flash.8388608_2097152.build.fs_start=274718720
generic_rp2350.menu.flash.8388608_2097152.build.fs_end=276815872
generic_rp2350.menu.flash.16777216_0=16MB (no FS)
generic_rp2350.menu.flash.16777216_0.upload.maximum_size=16769024
generic_rp2350.menu.flash.16777216_0.build.flash_total=16777216
generic_rp2350.menu.flash.16777216_0.build.flash_length=16769024
generic_rp2350.menu.flash.16777216_0.build.eeprom_start=285204480
generic_rp2350.menu.flash.16777216_0.build.fs_start=285204480
generic_rp2350.menu.flash.16777216_0.build.fs_end=285204480
generic_rp2350.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
generic_rp2350.menu.flash.16777216_15728640.upload.maximum_size=1040384
generic_rp2350.menu.flash.16777216_15728640.build.flash_total=16777216
generic_rp2350.menu.flash.16777216_15728640.build.flash_length=1040384
generic_rp2350.menu.flash.16777216_15728640.build.eeprom_start=285204480
generic_rp2350.menu.flash.16777216_15728640.build.fs_start=269475840
generic_rp2350.menu.flash.16777216_15728640.build.fs_end=285204480
generic_rp2350.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
generic_rp2350.menu.flash.16777216_14680064.upload.maximum_size=2088960
generic_rp2350.menu.flash.16777216_14680064.build.flash_total=16777216
generic_rp2350.menu.flash.16777216_14680064.build.flash_length=2088960
generic_rp2350.menu.flash.16777216_14680064.build.eeprom_start=285204480
generic_rp2350.menu.flash.16777216_14680064.build.fs_start=270524416
generic_rp2350.menu.flash.16777216_14680064.build.fs_end=285204480
generic_rp2350.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
generic_rp2350.menu.flash.16777216_12582912.upload.maximum_size=4186112
generic_rp2350.menu.flash.16777216_12582912.build.flash_total=16777216
generic_rp2350.menu.flash.16777216_12582912.build.flash_length=4186112
generic_rp2350.menu.flash.16777216_12582912.build.eeprom_start=285204480
generic_rp2350.menu.flash.16777216_12582912.build.fs_start=272621568
generic_rp2350.menu.flash.16777216_12582912.build.fs_end=285204480
generic_rp2350.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
generic_rp2350.menu.flash.16777216_8388608.upload.maximum_size=8380416
generic_rp2350.menu.flash.16777216_8388608.build.flash_total=16777216
generic_rp2350.menu.flash.16777216_8388608.build.flash_length=8380416
generic_rp2350.menu.flash.16777216_8388608.build.eeprom_start=285204480
generic_rp2350.menu.flash.16777216_8388608.build.fs_start=276815872
generic_rp2350.menu.flash.16777216_8388608.build.fs_end=285204480
generic_rp2350.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
generic_rp2350.menu.flash.16777216_4194304.upload.maximum_size=12574720
generic_rp2350.menu.flash.16777216_4194304.build.flash_total=16777216
generic_rp2350.menu.flash.16777216_4194304.build.flash_length=12574720
generic_rp2350.menu.flash.16777216_4194304.build.eeprom_start=285204480
generic_rp2350.menu.flash.16777216_4194304.build.fs_start=281010176
generic_rp2350.menu.flash.16777216_4194304.build.fs_end=285204480
generic_rp2350.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
generic_rp2350.menu.flash.16777216_2097152.upload.maximum_size=14671872
generic_rp2350.menu.flash.16777216_2097152.build.flash_total=16777216
generic_rp2350.menu.flash.16777216_2097152.build.flash_length=14671872
generic_rp2350.menu.flash.16777216_2097152.build.eeprom_start=285204480
generic_rp2350.menu.flash.16777216_2097152.build.fs_start=283107328
generic_rp2350.menu.flash.16777216_2097152.build.fs_end=285204480
generic_rp2350.menu.arch.arm=ARM
generic_rp2350.menu.arch.arm.build.chip=rp2350
generic_rp2350.menu.arch.arm.build.toolchain=arm-none-eabi
generic_rp2350.menu.arch.arm.build.toolchainpkg=pqt-gcc
generic_rp2350.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
generic_rp2350.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
generic_rp2350.menu.arch.arm.build.mcu=cortex-m33
generic_rp2350.menu.arch.riscv=RISC-V
generic_rp2350.menu.arch.riscv.build.chip=rp2350-riscv
generic_rp2350.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
generic_rp2350.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
generic_rp2350.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
generic_rp2350.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
generic_rp2350.menu.arch.riscv.build.mcu=rv32imac
generic_rp2350.menu.freq.150=150 MHz
generic_rp2350.menu.freq.150.build.f_cpu=150000000L
generic_rp2350.menu.freq.50=50 MHz
generic_rp2350.menu.freq.50.build.f_cpu=50000000L
generic_rp2350.menu.freq.100=100 MHz
generic_rp2350.menu.freq.100.build.f_cpu=100000000L
generic_rp2350.menu.freq.120=120 MHz
generic_rp2350.menu.freq.120.build.f_cpu=120000000L
generic_rp2350.menu.freq.125=125 MHz
generic_rp2350.menu.freq.125.build.f_cpu=125000000L
generic_rp2350.menu.freq.128=128 MHz
generic_rp2350.menu.freq.128.build.f_cpu=128000000L
generic_rp2350.menu.freq.133=133 MHz
generic_rp2350.menu.freq.133.build.f_cpu=133000000L
generic_rp2350.menu.freq.176=176 MHz (Overclock)
generic_rp2350.menu.freq.176.build.f_cpu=176000000L
generic_rp2350.menu.freq.200=200 MHz (Overclock)
generic_rp2350.menu.freq.200.build.f_cpu=200000000L
generic_rp2350.menu.freq.225=225 MHz (Overclock)
generic_rp2350.menu.freq.225.build.f_cpu=225000000L
generic_rp2350.menu.freq.240=240 MHz (Overclock)
generic_rp2350.menu.freq.240.build.f_cpu=240000000L
generic_rp2350.menu.freq.250=250 MHz (Overclock)
generic_rp2350.menu.freq.250.build.f_cpu=250000000L
generic_rp2350.menu.freq.276=276 MHz (Overclock)
generic_rp2350.menu.freq.276.build.f_cpu=276000000L
generic_rp2350.menu.freq.300=300 MHz (Overclock)
generic_rp2350.menu.freq.300.build.f_cpu=300000000L
generic_rp2350.menu.variantchip.RP2350A=RP2350A
generic_rp2350.menu.variantchip.RP2350A.build.variantdefines=-D__PICO_RP2350A=1
generic_rp2350.menu.variantchip.RP2350B=RP2350B
generic_rp2350.menu.variantchip.RP2350B.build.variantdefines=-D__PICO_RP2350A=0
generic_rp2350.menu.psramcs.GPIOnone=None
generic_rp2350.menu.psramcs.GPIOnone.build.psram_cs=
generic_rp2350.menu.psramcs.GPIO0=GPIO 0
generic_rp2350.menu.psramcs.GPIO0.build.psram_cs=-DRP2350_PSRAM_CS=0
generic_rp2350.menu.psramcs.GPIO1=GPIO 1
generic_rp2350.menu.psramcs.GPIO1.build.psram_cs=-DRP2350_PSRAM_CS=1
generic_rp2350.menu.psramcs.GPIO2=GPIO 2
generic_rp2350.menu.psramcs.GPIO2.build.psram_cs=-DRP2350_PSRAM_CS=2
generic_rp2350.menu.psramcs.GPIO3=GPIO 3
generic_rp2350.menu.psramcs.GPIO3.build.psram_cs=-DRP2350_PSRAM_CS=3
generic_rp2350.menu.psramcs.GPIO4=GPIO 4
generic_rp2350.menu.psramcs.GPIO4.build.psram_cs=-DRP2350_PSRAM_CS=4
generic_rp2350.menu.psramcs.GPIO5=GPIO 5
generic_rp2350.menu.psramcs.GPIO5.build.psram_cs=-DRP2350_PSRAM_CS=5
generic_rp2350.menu.psramcs.GPIO6=GPIO 6
generic_rp2350.menu.psramcs.GPIO6.build.psram_cs=-DRP2350_PSRAM_CS=6
generic_rp2350.menu.psramcs.GPIO7=GPIO 7
generic_rp2350.menu.psramcs.GPIO7.build.psram_cs=-DRP2350_PSRAM_CS=7
generic_rp2350.menu.psramcs.GPIO8=GPIO 8
generic_rp2350.menu.psramcs.GPIO8.build.psram_cs=-DRP2350_PSRAM_CS=8
generic_rp2350.menu.psramcs.GPIO9=GPIO 9
generic_rp2350.menu.psramcs.GPIO9.build.psram_cs=-DRP2350_PSRAM_CS=9
generic_rp2350.menu.psramcs.GPIO10=GPIO 10
generic_rp2350.menu.psramcs.GPIO10.build.psram_cs=-DRP2350_PSRAM_CS=10
generic_rp2350.menu.psramcs.GPIO11=GPIO 11
generic_rp2350.menu.psramcs.GPIO11.build.psram_cs=-DRP2350_PSRAM_CS=11
generic_rp2350.menu.psramcs.GPIO12=GPIO 12
generic_rp2350.menu.psramcs.GPIO12.build.psram_cs=-DRP2350_PSRAM_CS=12
generic_rp2350.menu.psramcs.GPIO13=GPIO 13
generic_rp2350.menu.psramcs.GPIO13.build.psram_cs=-DRP2350_PSRAM_CS=13
generic_rp2350.menu.psramcs.GPIO14=GPIO 14
generic_rp2350.menu.psramcs.GPIO14.build.psram_cs=-DRP2350_PSRAM_CS=14
generic_rp2350.menu.psramcs.GPIO15=GPIO 15
generic_rp2350.menu.psramcs.GPIO15.build.psram_cs=-DRP2350_PSRAM_CS=15
generic_rp2350.menu.psramcs.GPIO16=GPIO 16
generic_rp2350.menu.psramcs.GPIO16.build.psram_cs=-DRP2350_PSRAM_CS=16
generic_rp2350.menu.psramcs.GPIO17=GPIO 17
generic_rp2350.menu.psramcs.GPIO17.build.psram_cs=-DRP2350_PSRAM_CS=17
generic_rp2350.menu.psramcs.GPIO18=GPIO 18
generic_rp2350.menu.psramcs.GPIO18.build.psram_cs=-DRP2350_PSRAM_CS=18
generic_rp2350.menu.psramcs.GPIO19=GPIO 19
generic_rp2350.menu.psramcs.GPIO19.build.psram_cs=-DRP2350_PSRAM_CS=19
generic_rp2350.menu.psramcs.GPIO20=GPIO 20
generic_rp2350.menu.psramcs.GPIO20.build.psram_cs=-DRP2350_PSRAM_CS=20
generic_rp2350.menu.psramcs.GPIO21=GPIO 21
generic_rp2350.menu.psramcs.GPIO21.build.psram_cs=-DRP2350_PSRAM_CS=21
generic_rp2350.menu.psramcs.GPIO22=GPIO 22
generic_rp2350.menu.psramcs.GPIO22.build.psram_cs=-DRP2350_PSRAM_CS=22
generic_rp2350.menu.psramcs.GPIO23=GPIO 23
generic_rp2350.menu.psramcs.GPIO23.build.psram_cs=-DRP2350_PSRAM_CS=23
generic_rp2350.menu.psramcs.GPIO24=GPIO 24
generic_rp2350.menu.psramcs.GPIO24.build.psram_cs=-DRP2350_PSRAM_CS=24
generic_rp2350.menu.psramcs.GPIO25=GPIO 25
generic_rp2350.menu.psramcs.GPIO25.build.psram_cs=-DRP2350_PSRAM_CS=25
generic_rp2350.menu.psramcs.GPIO26=GPIO 26
generic_rp2350.menu.psramcs.GPIO26.build.psram_cs=-DRP2350_PSRAM_CS=26
generic_rp2350.menu.psramcs.GPIO27=GPIO 27
generic_rp2350.menu.psramcs.GPIO27.build.psram_cs=-DRP2350_PSRAM_CS=27
generic_rp2350.menu.psramcs.GPIO28=GPIO 28
generic_rp2350.menu.psramcs.GPIO28.build.psram_cs=-DRP2350_PSRAM_CS=28
generic_rp2350.menu.psramcs.GPIO29=GPIO 29
generic_rp2350.menu.psramcs.GPIO29.build.psram_cs=-DRP2350_PSRAM_CS=29
generic_rp2350.menu.psramcs.GPIO30=GPIO 30
generic_rp2350.menu.psramcs.GPIO30.build.psram_cs=-DRP2350_PSRAM_CS=30
generic_rp2350.menu.psramcs.GPIO31=GPIO 31
generic_rp2350.menu.psramcs.GPIO31.build.psram_cs=-DRP2350_PSRAM_CS=31
generic_rp2350.menu.psramcs.GPIO32=GPIO 32
generic_rp2350.menu.psramcs.GPIO32.build.psram_cs=-DRP2350_PSRAM_CS=32
generic_rp2350.menu.psramcs.GPIO33=GPIO 33
generic_rp2350.menu.psramcs.GPIO33.build.psram_cs=-DRP2350_PSRAM_CS=33
generic_rp2350.menu.psramcs.GPIO34=GPIO 34
generic_rp2350.menu.psramcs.GPIO34.build.psram_cs=-DRP2350_PSRAM_CS=34
generic_rp2350.menu.psramcs.GPIO35=GPIO 35
generic_rp2350.menu.psramcs.GPIO35.build.psram_cs=-DRP2350_PSRAM_CS=35
generic_rp2350.menu.psramcs.GPIO36=GPIO 36
generic_rp2350.menu.psramcs.GPIO36.build.psram_cs=-DRP2350_PSRAM_CS=36
generic_rp2350.menu.psramcs.GPIO37=GPIO 37
generic_rp2350.menu.psramcs.GPIO37.build.psram_cs=-DRP2350_PSRAM_CS=37
generic_rp2350.menu.psramcs.GPIO38=GPIO 38
generic_rp2350.menu.psramcs.GPIO38.build.psram_cs=-DRP2350_PSRAM_CS=38
generic_rp2350.menu.psramcs.GPIO39=GPIO 39
generic_rp2350.menu.psramcs.GPIO39.build.psram_cs=-DRP2350_PSRAM_CS=39
generic_rp2350.menu.psramcs.GPIO40=GPIO 40
generic_rp2350.menu.psramcs.GPIO40.build.psram_cs=-DRP2350_PSRAM_CS=40
generic_rp2350.menu.psramcs.GPIO41=GPIO 41
generic_rp2350.menu.psramcs.GPIO41.build.psram_cs=-DRP2350_PSRAM_CS=41
generic_rp2350.menu.psramcs.GPIO42=GPIO 42
generic_rp2350.menu.psramcs.GPIO42.build.psram_cs=-DRP2350_PSRAM_CS=42
