UNIT-Electronics/Uelectronics-RP2040-Arduino-Package/patches/boards/boards.txt
generic_rp2350.menu.psramcs.GPIO43=GPIO 43
generic_rp2350.menu.psramcs.GPIO43.build.psram_cs=-DRP2350_PSRAM_CS=43
generic_rp2350.menu.psramcs.GPIO44=GPIO 44
generic_rp2350.menu.psramcs.GPIO44.build.psram_cs=-DRP2350_PSRAM_CS=44
generic_rp2350.menu.psramcs.GPIO45=GPIO 45
generic_rp2350.menu.psramcs.GPIO45.build.psram_cs=-DRP2350_PSRAM_CS=45
generic_rp2350.menu.psramcs.GPIO46=GPIO 46
generic_rp2350.menu.psramcs.GPIO46.build.psram_cs=-DRP2350_PSRAM_CS=46
generic_rp2350.menu.psramcs.GPIO47=GPIO 47
generic_rp2350.menu.psramcs.GPIO47.build.psram_cs=-DRP2350_PSRAM_CS=47
generic_rp2350.menu.psram.0mb=0MByte PSRAM
generic_rp2350.menu.psram.0mb.build.psram_length=0x000000
generic_rp2350.menu.psram.2mb=2MByte PSRAM
generic_rp2350.menu.psram.2mb.build.psram_length=0x200000
generic_rp2350.menu.psram.4mb=4MByte PSRAM
generic_rp2350.menu.psram.4mb.build.psram_length=0x400000
generic_rp2350.menu.psram.8mb=8MByte PSRAM
generic_rp2350.menu.psram.8mb.build.psram_length=0x800000
generic_rp2350.menu.psram.16mb=16MByte PSRAM
generic_rp2350.menu.psram.16mb.build.psram_length=0x1600000
generic_rp2350.menu.psramfreq.freq104=104 MHz
generic_rp2350.menu.psramfreq.freq104.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=104000000
generic_rp2350.menu.psramfreq.freq109=109 MHz
generic_rp2350.menu.psramfreq.freq109.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=109000000
generic_rp2350.menu.psramfreq.freq133=133 MHz
generic_rp2350.menu.psramfreq.freq133.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=133000000
generic_rp2350.menu.opt.Small=Small (-Os) (standard)
generic_rp2350.menu.opt.Small.build.flags.optimize=-Os
generic_rp2350.menu.opt.Optimize=Optimize (-O)
generic_rp2350.menu.opt.Optimize.build.flags.optimize=-O
generic_rp2350.menu.opt.Optimize2=Optimize More (-O2)
generic_rp2350.menu.opt.Optimize2.build.flags.optimize=-O2
generic_rp2350.menu.opt.Optimize3=Optimize Even More (-O3)
generic_rp2350.menu.opt.Optimize3.build.flags.optimize=-O3
generic_rp2350.menu.opt.Fast=Fast (-Ofast) (maybe slower)
generic_rp2350.menu.opt.Fast.build.flags.optimize=-Ofast
generic_rp2350.menu.opt.Debug=Debug (-Og)
generic_rp2350.menu.opt.Debug.build.flags.optimize=-Og
generic_rp2350.menu.opt.Disabled=Disabled (-O0)
generic_rp2350.menu.opt.Disabled.build.flags.optimize=-O0
generic_rp2350.menu.os.none=None
generic_rp2350.menu.os.none.build.os=
generic_rp2350.menu.os.freertos=FreeRTOS SMP
generic_rp2350.menu.os.freertos.build.os=-D__FREERTOS
generic_rp2350.menu.profile.Disabled=Disabled
generic_rp2350.menu.profile.Disabled.build.flags.profile=
generic_rp2350.menu.profile.Enabled=Enabled
generic_rp2350.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
generic_rp2350.menu.rtti.Disabled=Disabled
generic_rp2350.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
generic_rp2350.menu.rtti.Enabled=Enabled
generic_rp2350.menu.rtti.Enabled.build.flags.rtti=
generic_rp2350.menu.stackprotect.Disabled=Disabled
generic_rp2350.menu.stackprotect.Disabled.build.flags.stackprotect=
generic_rp2350.menu.stackprotect.Enabled=Enabled
generic_rp2350.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
generic_rp2350.menu.exceptions.Disabled=Disabled
generic_rp2350.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
generic_rp2350.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
generic_rp2350.menu.exceptions.Enabled=Enabled
generic_rp2350.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
generic_rp2350.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
generic_rp2350.menu.dbgport.Disabled=Disabled
generic_rp2350.menu.dbgport.Disabled.build.debug_port=
generic_rp2350.menu.dbgport.Serial=Serial
generic_rp2350.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
generic_rp2350.menu.dbgport.Serial1=Serial1
generic_rp2350.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
generic_rp2350.menu.dbgport.Serial2=Serial2
generic_rp2350.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
generic_rp2350.menu.dbgport.SerialSemi=SerialSemi
generic_rp2350.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
generic_rp2350.menu.dbglvl.None=None
generic_rp2350.menu.dbglvl.None.build.debug_level=
generic_rp2350.menu.dbglvl.Core=Core
generic_rp2350.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
generic_rp2350.menu.dbglvl.SPI=SPI
generic_rp2350.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
generic_rp2350.menu.dbglvl.Wire=Wire
generic_rp2350.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
generic_rp2350.menu.dbglvl.Bluetooth=Bluetooth
generic_rp2350.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
generic_rp2350.menu.dbglvl.BLE=BLE
generic_rp2350.menu.dbglvl.BLE.build.debug_level=-DDEBUG_RP2040_BLE
generic_rp2350.menu.dbglvl.LWIP=LWIP
generic_rp2350.menu.dbglvl.LWIP.build.debug_level=-DLWIP_DEBUG=1
generic_rp2350.menu.dbglvl.All=All
generic_rp2350.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH -DDEBUG_RP2040_BLE -DLWIP_DEBUG=1
generic_rp2350.menu.dbglvl.NDEBUG=NDEBUG
generic_rp2350.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
generic_rp2350.menu.usbstack.picosdk=Pico SDK
generic_rp2350.menu.usbstack.picosdk.build.usbstack_flags=
generic_rp2350.menu.usbstack.tinyusb=Adafruit TinyUSB
generic_rp2350.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
generic_rp2350.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
generic_rp2350.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
generic_rp2350.menu.usbstack.nousb=No USB
generic_rp2350.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
generic_rp2350.menu.ipbtstack.ipv4only=IPv4 Only
generic_rp2350.menu.ipbtstack.ipv4only.build.libpicow=liblwip.a
generic_rp2350.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
generic_rp2350.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
generic_rp2350.menu.ipbtstack.ipv4ipv6.build.libpicow=liblwip.a
generic_rp2350.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
generic_rp2350.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
generic_rp2350.menu.ipbtstack.ipv4btcble.build.libpicow=liblwip-bt.a
generic_rp2350.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
generic_rp2350.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
generic_rp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=liblwip-bt.a
generic_rp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
generic_rp2350.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
generic_rp2350.menu.ipbtstack.ipv4onlybig.build.libpicow=liblwip.a
generic_rp2350.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
generic_rp2350.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
generic_rp2350.menu.ipbtstack.ipv4ipv6big.build.libpicow=liblwip.a
generic_rp2350.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
generic_rp2350.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
generic_rp2350.menu.ipbtstack.ipv4btcblebig.build.libpicow=liblwip-bt.a
generic_rp2350.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
generic_rp2350.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
generic_rp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=liblwip-bt.a
generic_rp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
generic_rp2350.menu.uploadmethod.default=Default (UF2)
generic_rp2350.menu.uploadmethod.default.build.ram_length=512k
generic_rp2350.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
generic_rp2350.menu.uploadmethod.default.upload.maximum_data_size=524288
generic_rp2350.menu.uploadmethod.default.upload.tool=uf2conv
generic_rp2350.menu.uploadmethod.default.upload.tool.default=uf2conv
generic_rp2350.menu.uploadmethod.default.upload.tool.network=uf2conv-network
generic_rp2350.menu.uploadmethod.picotool=Picotool
generic_rp2350.menu.uploadmethod.picotool.build.ram_length=512k
generic_rp2350.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
generic_rp2350.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
generic_rp2350.menu.uploadmethod.picotool.upload.maximum_data_size=524288
generic_rp2350.menu.uploadmethod.picotool.upload.tool=picotool
generic_rp2350.menu.uploadmethod.picotool.upload.tool.default=picotool
generic_rp2350.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
generic_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
generic_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
generic_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
generic_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
generic_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
